import cv2
import numpy as np

class QuantizeBlocks:

    def __init__(self, q_matrix=None, quality=0):

        self.quality = quality

        if q_matrix is not None:
            self.q_matrices = q_matrix
        else:
            self.q_matrices = [
                np.array([  # Matrix for Y
                    [16, 11, 10, 16, 24, 40, 51, 61],
                    [12, 12, 14, 19, 26, 58, 60, 55],
                    [14, 13, 16, 24, 40, 57, 69, 56],
                    [14, 17, 22, 29, 51, 87, 80, 62],
                    [18, 22, 37, 56, 68, 109, 103, 77],
                    [24, 35, 55, 64, 81, 104, 113, 92],
                    [49, 64, 78, 87, 103, 121, 120, 101],
                    [72, 92, 95, 98, 112, 100, 103, 99]
                ]),
                np.array([  # Matrix for Cb
                    [17, 18, 24, 47, 99, 99, 99, 99],
                    [18, 21, 26, 66, 99, 99, 99, 99],
                    [24, 26, 56, 99, 99, 99, 99, 99],
                    [47, 66, 99, 99, 99, 99, 99, 99],
                    [99, 99, 99, 99, 99, 99, 99, 99],
                    [99, 99, 99, 99, 99, 99, 99, 99],
                    [99, 99, 99, 99, 99, 99, 99, 99],
                    [99, 99, 99, 99, 99, 99, 99, 99]
                ]),
                np.array([  # Matrix for Cr
                    [17, 18, 24, 47, 99, 99, 99, 99],
                    [18, 21, 26, 66, 99, 99, 99, 99],
                    [24, 26, 56, 99, 99, 99, 99, 99],
                    [47, 66, 99, 99, 99, 99, 99, 99],
                    [99, 99, 99, 99, 99, 99, 99, 99],
                    [99, 99, 99, 99, 99, 99, 99, 99],
                    [99, 99, 99, 99, 99, 99, 99, 99],
                    [99, 99, 99, 99, 99, 99, 99, 99]
                ])
            ]


    def scale_quantiztion_matrices(self, quality):
        if quality == 2:
            self.q_scale_matrices = [
                np.array([
                    [16,11,10,16,24, 40, 51, 61],
                    [12,12,14,19,26, 58, 60, 55],
                    [14,13,16,24,40, 57, 69, 56],
                    [14,17,22,29,51, 87, 80, 62],
                    [18,22,37,56,68,109,103, 77],
                    [24,35,55,64,81,104,113, 92],
                    [49,64,78,87,103,121,120,101],
                    [72,92,95,98,112,100,103, 99]
                ]),
                np.array([
                    [17,18,24,47,99,99,99,99],
                    [18,21,26,66,99,99,99,99],
                    [24,26,56,99,99,99,99,99],
                    [47,66,99,99,99,99,99,99],
                    [99,99,99,99,99,99,99,99],
                    [99,99,99,99,99,99,99,99],
                    [99,99,99,99,99,99,99,99],
                    [99,99,99,99,99,99,99,99]
                ]),
                np.array([
                    [17,18,24,47,99,99,99,99],
                    [18,21,26,66,99,99,99,99],
                    [24,26,56,99,99,99,99,99],
                    [47,66,99,99,99,99,99,99],
                    [99,99,99,99,99,99,99,99],
                    [99,99,99,99,99,99,99,99],
                    [99,99,99,99,99,99,99,99],
                    [99,99,99,99,99,99,99,99]
                ])
            ]
        elif quality == 5:
             self.q_scale_matrices = [
                np.array([
                    [16, 14, 13, 20, 30, 50, 64, 77],
                    [15, 15, 17, 24, 33, 77, 80, 73],
                    [17, 16, 20, 30, 50, 73, 88, 72],
                    [17, 21, 27, 36, 64,109,100, 78],
                    [22, 27, 45, 68, 82,132,124, 93],
                    [30, 44, 72, 84,107,138,150,122],
                    [64, 84,100,109,124,145,144,121],
                    [93,122,126,130,150,138,142,137]
                ]),
                np.array([
                    [17, 25, 33, 65,137,137,137,137],
                    [25, 29, 36, 91,137,137,137,137],
                    [33, 36, 76,137,137,137,137,137],
                    [65, 91,137,137,137,137,137,137],
                    [137,137,137,137,137,137,137,137],
                    [137,137,137,137,137,137,137,137],
                    [137,137,137,137,137,137,137,137],
                    [137,137,137,137,137,137,137,137]
                ]),
                np.array([
                    [17, 25, 33, 65,137,137,137,137],
                    [25, 29, 36, 91,137,137,137,137],
                    [33, 36, 76,137,137,137,137,137],
                    [65, 91,137,137,137,137,137,137],
                    [137,137,137,137,137,137,137,137],
                    [137,137,137,137,137,137,137,137],
                    [137,137,137,137,137,137,137,137],
                    [137,137,137,137,137,137,137,137]
                ])
            ]
        elif quality == 7:
             self.q_scale_matrices = [
                np.array([
                    [16, 18, 17, 27, 40, 67, 85,102],
                    [20, 20, 23, 35, 47,102,106, 96],
                    [23, 21, 27, 40, 67, 96,116, 95],
                    [23, 29, 37, 49, 85,145,134,104],
                    [30, 37, 60, 91,111,179,168,126],
                    [40, 58, 95,111,141,182,198,161],
                    [85,111,134,145,168,197,196,165],
                    [126,161,166,170,198,182,188,181]
                ]),
                np.array([
                    [17, 32, 43, 85,179,179,179,179],
                    [32, 37, 47,119,179,179,179,179],
                    [43, 47, 99,179,179,179,179,179],
                    [85,119,179,179,179,179,179,179],
                    [179,179,179,179,179,179,179,179],
                    [179,179,179,179,179,179,179,179],
                    [179,179,179,179,179,179,179,179],
                    [179,179,179,179,179,179,179,179]
                ]),
                np.array([
                    [17, 32, 43, 85,179,179,179,179],
                    [32, 37, 47,119,179,179,179,179],
                    [43, 47, 99,179,179,179,179,179],
                    [85,119,179,179,179,179,179,179],
                    [179,179,179,179,179,179,179,179],
                    [179,179,179,179,179,179,179,179],
                    [179,179,179,179,179,179,179,179],
                    [179,179,179,179,179,179,179,179]
                ])
            ]        
             

    def quantize_dct_bloks(self, bloks, quality=0):
        """
        Quantizes the DCT coefficients using the selected quality factor.
        
        Args:
            blocks (np.array): DCT blocks to quantize.
            quality (int): Quality factor (0 = default matrices).
        
        Returns:
            np.array: Quantized blocks.
        """
        #np.set_printoptions(precision=2, suppress=True)
        # print(bloks[:1, :, :, :, 1])
        if quality == 0:
            H, W, block_size, _, channels = bloks.shape
            self.quantized_blocks = np.zeros_like(bloks, dtype=np.int32)

            for c in range(channels):
                for i in range(H):
                    for j in range(W):
                        self.quantized_blocks[i, j, :, :, c] = np.round(bloks[i, j, :, :, c] / self.q_matrices[c])

            #print(self.quantized_blocks[:1, :, :, :, 1])
            return self.quantized_blocks
        
        else:
            self.scale_quantiztion_matrices(quality)
            H, W, block_size, _, channels = bloks.shape
            self.quantized_blocks = np.zeros_like(bloks, dtype=np.int32)


            for c in range(channels):
                for i in range(H):
                    for j in range(W):
                        self.quantized_blocks[i, j, :, :, c] = np.round(bloks[i, j, :, :, c] / self.q_scale_matrices[c])

            #print(self.quantized_blocks[:1, :, :, :, 1])
            return self.quantized_blocks
        



        # Decoded
    def dequantize_blocks(self, quantized_blocks, block_size):
        """
        Восстановить коэффициенты DCT из квантованных значений.
        :param quantized_blocks: массив квантованных коэффициентов (H, W, block_size, block_size, channels)
        :param quality: параметр показывающий нужно спользовать встроенные матрицы квантования или кастомные
        :return: массив деквантованных коэффициентов DCT
        """
        #TODO  сделать по условию quality

        print(quantized_blocks.shape)
        H, W, block_size, _, channels = quantized_blocks.shape
        dct_blocks = np.zeros_like(quantized_blocks, dtype=np.float32)

        for c in range(channels):
            for i in range(H):
                for j in range(W):
                    dct_blocks[i, j, :, :, c] = quantized_blocks[i, j, :, :, c] * self.q_matrices[c]

        return dct_blocks